[
    {
        "id": 1,
        "title": "Fish Legends",
        "type": "app",
        "category": "college",
        "desc": "Fish Legends is an engaging desktop game designed for the Windows operating system. Players need to take control of an underwater vehicle, aiming to achieve the highest score by catching or hitting various sea creatures. It has equipped me with valuable skills in desktop application development, database management, and user interface design.",
        "tech": [
            "C#",
            ".NET",
            "WinForms",
            "Microsoft Access"
        ],
        "link": "https://github.com/FaizRahman01/AD_SeaAnimalGame",
        "image": [
            "fishgame01.png",
            "fishgame02.png"
        ]
    },
    {
        "id": 2,
        "title": "Krunker Idea Portal",
        "type": "web",
        "category": "college",
        "desc": "The Krunker Idea Portal is a web-based forum tailored for school institution staff to share and discuss improvement ideas. The system incorporates different user roles, each with its own features. I gained experience in web development, database design, and user authentication, contributing to my proficiency in creating interactive and role-based web applications with a basic of PHP.",
        "tech": [
            "PHP",
            "MySQL",
            "JavaScript"
        ],
        "link": "https://github.com/FaizRahman01/COMP1640_CW-krunkerOG",
        "image": [
            "krunkeridea01.png",
            "krunkeridea02.png"
        ]
    },
    {
        "id": 3,
        "title": "M-Expense",
        "type": "app",
        "category": "college",
        "desc": "M-Expense is a mobile app designed to streamline the process of work trip expense claims for company staff. Users can conveniently add multiple expense types under a single trip. This project has enhanced my mobile app development skills just by using web technologies and convert it to mobile app.",
        "tech": [
            "HTML",
            "CSS",
            "JavaScript",
            "SQLite",
            "Bootstrap",
            "Zepto.js"
        ],
        "link": "https://github.com/FaizRahman01/mexpense_bcomp3402",
        "image": [
            "tripexpense01.png",
            "tripexpense02.png"
        ]
    },
    {
        "id": 4,
        "title": "NPU Mobile",
        "type": "app",
        "category": "internship",
        "desc": "NPU Mobile serves as a mobile app for sales staff, facilitating the recording of sales data by integrating with the company's existing database through APIs. This project honed my expertise in cross-platform mobile app development, API integration, and real-time data synchronization. The experience gained has equipped me to deliver efficient and responsive mobile solutions.",
        "tech": [
            "React Native",
            "Expo",
            "API"
        ],
        "link": "https://www.youtube.com/watch?v=1YEMywna9Bs",
        "image": [
            "recordsale01.png",
            "recordsale02.png",
            "recordsale03.png"
        ]
    },
    {
        "id": 5,
        "title": "GoMyjlis",
        "type": "web",
        "category": "college",
        "desc": "GoMyjlis is a project developed as part of my final year, aimed at assisting users with no event management experience in creating small events. The final product demonstrates my ability to design and implement a solution for event creation, highlighting my growth in software development throughout my academic journey.",
        "tech": [
            "Laravel",
            "MySQL"
        ],
        "link": "https://github.com/FaizRahman01/GoMyjlis",
        "image": [
            "gomyjlis01.png",
            "gomyjlis02.png",
            "gomyjlis03.png"
        ]
    }
]